/***
	*******************************************************************************************************************************************************************
	* @file    delay.c
	* @version V2.1
	* @date    2024-7-22
	* @author  御龙	
	* @brief   MSPM0G3507小车PID调试通用模板
   *************************************************************************************************
   *  @description
	*	
	*  接口配置可以使用Sysconfig看
   *
>>>>> 其他说明：未经允许不可擅自转发、售卖本套代码，大家都是我国的有为青年，请保持好自己的初心，在此，向你表达我的感谢
	*************************************************************************************************************************************************************
***/

#include "delay.h"

//系统的延时函数（较稳定）
void delay_ms(uint32_t ms)
{
	delay_cycles(ms*(CPUCLK_FREQ/1000)); //32000 如果为 32Mhz
}
void delay_us(uint32_t us)
{
	delay_cycles(us*(CPUCLK_FREQ/1000000)); //32 如果为 32Mhz
}


